// Напишите программу, которая принимает на вход число (N) 
//и выдаёт таблицу кубов чисел от 1 до N.//
void PrintTheThirdDegreeToConsole (int n)
{
   for (int=1; i<=1; i++);
   {
    Console.WriteLine (i*i*i);
   }
}

Console.WriteLine ("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());

PrintTheThirdDegreeToConsole (int);