// Напишите программу, которая принимает на вход 
//пятизначное число и проверяет, является ли оно палиндромом//
Console.WriteLine("Введите пятизначное число: ");
number = Convert.ToInt32(Console.ReadLine());


 void CheckingNumber(number);

 if (Number[0]==Number[4]||Number[1]==Number [3])
 Console.WriteLine("Чиcло является палиндромом");
 else 
 {
Console.WriteLine("Чиcло не является палиндромом");
 };
CheckingNumber (Number);
